# Part 2: Full Data Workflow A-Z

## Importing from Excel Files with pd.read_excel()

### First Steps

In [4]:
import pandas as pd

In [9]:
sales = pd.read_excel("sales.xls")

In [13]:
sales

  Unnamed: 0      City Country  Sales  Bonus
0       Mike  New York     USA     25   2.50
1        Jim    Boston     USA     43   4.30
2     Steven    London      UK     76   7.60
3        Joe    Madrid   Spain     12   1.80
4        Tom     Paris  France     89  13.35

In [7]:
sales

  Unnamed: 0      City Country  Sales  Bonus
0       Mike  New York     USA     25   2.50
1        Jim    Boston     USA     43   4.30
2     Steven    London      UK     76   7.60
3        Joe    Madrid   Spain     12   1.80
4        Tom     Paris  France     89  13.35

In [2]:
sales = pd.read_excel("sales.xls", index_col= 0)

In [3]:
sales

            City Country  Sales  Bonus
Mike    New York     USA     25   2.50
Jim       Boston     USA     43   4.30
Steven    London      UK     76   7.60
Joe       Madrid   Spain     12   1.80
Tom        Paris  France     89  13.35

In [ ]:
sales.info()

In [14]:
pd.read_excel("sales.xls", index_col = 0, header = 0)

            City Country  Sales  Bonus
Mike    New York     USA     25   2.50
Jim       Boston     USA     43   4.30
Steven    London      UK     76   7.60
Joe       Madrid   Spain     12   1.80
Tom        Paris  France     89  13.35

In [15]:
pd.read_excel("sales.xls", index_col = 0, header = 0, names = ["Name", "Loc_City", "Loc_Country", "Revenue", "Add_Comp"])

        Loc_City Loc_Country  Revenue  Add_Comp
Name
Mike    New York         USA       25      2.50
Jim       Boston         USA       43      4.30
Steven    London          UK       76      7.60
Joe       Madrid       Spain       12      1.80
Tom        Paris      France       89     13.35

In [16]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = "A:C")

            City Country
Mike    New York     USA
Jim       Boston     USA
Steven    London      UK
Joe       Madrid   Spain
Tom        Paris  France

In [17]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = "C:E")

         Sales  Bonus
Country
USA         25   2.50
USA         43   4.30
UK          76   7.60
Spain       12   1.80
France      89  13.35

In [18]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = "A, C:E")

       Country  Sales  Bonus
Mike       USA     25   2.50
Jim        USA     43   4.30
Steven      UK     76   7.60
Joe      Spain     12   1.80
Tom     France     89  13.35

In [19]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = ":C")

            City Country
Mike    New York     USA
Jim       Boston     USA
Steven    London      UK
Joe       Madrid   Spain
Tom        Paris  France

In [ ]:
#pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = "C:")

In [20]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = [0,3,4])

        Sales  Bonus
Mike       25   2.50
Jim        43   4.30
Steven     76   7.60
Joe        12   1.80
Tom        89  13.35

In [22]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = 2)

ValueError: Passing an integer for `usecols` is no longer supported.  Please pass in a list of int from 0 to `usecols` inclusive instead.

In [ ]:
pd.read_excel("sales.xls", index_col = 0, header = 0, usecols = ["City", "Sales"])

### Customizing import with pd.read_excel()

In [23]:
import pandas as pd

In [24]:
pd.read_excel("summer_raw.xls")

  Unnamed: 0      City Country  Sales  Bonus
0       Mike  New York     USA     25    2.5
1        Jim    Boston     USA     43    4.3
2     Steven    London      UK     76    7.6
3        Joe    Madrid   Spain     12    1.8
4        Tom     Paris  France     89   13.4

In [ ]:
pd.read_excel("summer_raw.xls", sheet_name = 1)

In [ ]:
pd.read_excel("summer_raw.xls", sheet_name = "summer", skiprows= [0,1])

In [ ]:
pd.read_excel("summer_raw.xls", sheet_name = "summer", skiprows= 2, usecols= "D:L")

In [ ]:
summer = pd.read_excel("summer_raw.xls", sheet_name = "summer", skiprows= 2, usecols= "D:L")

In [ ]:
summer.head()

In [ ]:
summer.tail()

In [ ]:
summer.info()

In [ ]:
summer.to_csv("summer_imp.csv", index= False)

In [ ]:
summer.to_excel("summer_imp.xls")

In [ ]:
pd.read_csv("summer_imp.csv")

In [ ]:
summer